
//---------------------------------------------------------------------------------
//ЗАДАНИЕ 1, ВЫРАЖЕНИЕ a * (b + (c / d))
//--------------------------------------------------------------------------------- 
#include <iostream>
using namespace std;
int a = 2;
int b = 3;
int c = 4;
int d = 5;
float e;

int main_First()
{    

    e = float(a) * (b + (float(c) / d));
    std::cout << "Результат выражения a * (b + (c / d)):\n"<< e << std::endl;
    return 0;
}
//---------------------------------------------------------------------------------


//---------------------------------------------------------------------------------
//ЗАДАНИЕ 2, C ТЕРНАРНЫМ ОПЕРАТОРОМ
//---------------------------------------------------------------------------------
int l = 22;
int g;
int h;
int j;


int main_Second()
{
    g = l - 21;
    h = (l - 21) * 2;
    j = (l <= 21) ? g : h;
    std::cout << "Результат выражения с тернарным оператором:\n" << j << std::endl;
    return 0;
}


//---------------------------------------------------------------------------------
//ЗАДАНИЕ 3, МАССИВ [3][3][3]
//---------------------------------------------------------------------------------

int main_third()
{
    int Array[3][3][3] =
    {
        {
            {1, 2, 3},
            {4, 5, 6},
            {7, 8, 9}
        },
        {
            {10, 11, 12},
            {13, 14, 15},
            {16, 17, 18}
        },
        {
            {19, 20, 21},
            {22, 23, 24},
            {25, 26, 27}
        }
    };

    int* pArr = nullptr;

    pArr = &Array[1][1][1];

    std::cout << "Вывод элемента массива напрямую:" << std::endl;
    cout << Array[1][1][1] << endl;
    std::cout << "Вывод элемента массива через указатель:" << std::endl;
    cout << *pArr << endl;
    return 0;
}


//---------------------------------------------------------------------------------
//ЗАДАНИЕ 4
//---------------------------------------------------------------------------------
int var = 1000;
int var1 = 100;